In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame(
	{
		'col_1': [1,2,3,4],
		'col_2': [444,555,666,444],
		'col_3': ['abc', 'def', 'ghi', 'xyz']
	}
)
df.head()

   col_1  col_2 col_3
0      1    444   abc
1      2    555   def
2      3    666   ghi
3      4    444   xyz

In [5]:
df['col_2'].nunique()

3

In [7]:
df['col_2'].value_counts()

444    2
555    1
666    1
Name: col_2, dtype: int64

In [10]:
df[(df['col_1']>2) & (df['col_2'] == 444)]

   col_1  col_2 col_3
3      4    444   xyz

In [11]:
def times_2(x):
	return x * 2

In [15]:
df['col_2'].apply(lambda x: x * 2)

0     888
1    1110
2    1332
3     888
Name: col_2, dtype: int64

In [16]:
df

   col_1  col_2 col_3
0      1    444   abc
1      2    555   def
2      3    666   ghi
3      4    444   xyz

In [17]:
df.drop('col_1', axis=1)

   col_2 col_3
0    444   abc
1    555   def
2    666   ghi
3    444   xyz

In [18]:
df

   col_1  col_2 col_3
0      1    444   abc
1      2    555   def
2      3    666   ghi
3      4    444   xyz

In [19]:
df.columns

Index(['col_1', 'col_2', 'col_3'], dtype='object')

In [20]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [21]:
df

   col_1  col_2 col_3
0      1    444   abc
1      2    555   def
2      3    666   ghi
3      4    444   xyz

In [22]:
df.sort_values('col_2')

   col_1  col_2 col_3
0      1    444   abc
3      4    444   xyz
1      2    555   def
2      3    666   ghi

In [24]:
df.isnull()

   col_1  col_2  col_3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

Pivot Tables

In [26]:
data = {
	'A': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
	'B': ['one','one','two','two','one','one'],
	'C': ['x','y','x','y','x','y'],
	'D': [1,3,2,5,4,1]
}

df = pd.DataFrame(data)

In [27]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [28]:
df.pivot_table(values='D', index=['A', 'B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN